Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/otpc.h
/* -------- OTPC_SR : (OTPC Offset: 0x0C) ( R/ 32) Status Register -------- */
#define OTPC_SR_PGM_Pos                       _U_(0)                                               /**< (OTPC_SR) Programming On-Going Position */
#define OTPC_SR_PGM_Msk                       (_U_(0x1) << OTPC_SR_PGM_Pos)                        /**< (OTPC_SR) Programming On-Going Mask */
#define OTPC_SR_PGM(value)                    (OTPC_SR_PGM_Msk & ((value) << OTPC_SR_PGM_Pos))    
#define OTPC_SR_LOCK_Pos                      _U_(1)                                               /**< (OTPC_SR) Lock On-Going Position */
#define OTPC_SR_LOCK_Msk                      (_U_(0x1) << OTPC_SR_LOCK_Pos)                       /**< (OTPC_SR) Lock On-Going Mask */
#define OTPC_SR_LOCK(value)                   (OTPC_SR_LOCK_Msk & ((value) << OTPC_SR_LOCK_Pos))  
#define OTPC_SR_INVLD_Pos                     _U_(2)                                               /**< (OTPC_SR) Invalidation On-Going Position */
#define OTPC_SR_INVLD_Msk                     (_U_(0x1) << OTPC_SR_INVLD_Pos)                      /**< (OTPC_SR) Invalidation On-Going Mask */
#define OTPC_SR_INVLD(value)                  (OTPC_SR_INVLD_Msk & ((value) << OTPC_SR_INVLD_Pos))
#define OTPC_SR_EMUL_Pos                      _U_(3)                                               /**< (OTPC_SR) Emulation Enabled Position */
#define OTPC_SR_EMUL_Msk                      (_U_(0x1) << OTPC_SR_EMUL_Pos)                       /**< (OTPC_SR) Emulation Enabled Mask */
#define OTPC_SR_EMUL(value)                   (OTPC_SR_EMUL_Msk & ((value) << OTPC_SR_EMUL_Pos))  
#define OTPC_SR_MKBB_Pos                      _U_(4)                                               /**< (OTPC_SR) Master Key Bus Busy Position */
#define OTPC_SR_MKBB_Msk                      (_U_(0x1) << OTPC_SR_MKBB_Pos)                       /**< (OTPC_SR) Master Key Bus Busy Mask */
#define OTPC_SR_MKBB(value)                   (OTPC_SR_MKBB_Msk & ((value) << OTPC_SR_MKBB_Pos))  
#define OTPC_SR_SKBB_Pos                      _U_(5)                                               /**< (OTPC_SR) Slave Key Bus Busy Position */
#define OTPC_SR_SKBB_Msk                      (_U_(0x1) << OTPC_SR_SKBB_Pos)                       /**< (OTPC_SR) Slave Key Bus Busy Mask */
#define OTPC_SR_SKBB(value)                   (OTPC_SR_SKBB_Msk & ((value) << OTPC_SR_SKBB_Pos))  
#define OTPC_SR_READ_Pos                      _U_(6)                                               /**< (OTPC_SR) Read On-Going Position */
#define OTPC_SR_READ_Msk                      (_U_(0x1) << OTPC_SR_READ_Pos)                       /**< (OTPC_SR) Read On-Going Mask */
#define OTPC_SR_READ(value)                   (OTPC_SR_READ_Msk & ((value) << OTPC_SR_READ_Pos))  
#define OTPC_SR_FLUSH_Pos                     _U_(7)                                               /**< (OTPC_SR) Flush On-Going Position */
#define OTPC_SR_FLUSH_Msk                     (_U_(0x1) << OTPC_SR_FLUSH_Pos)                      /**< (OTPC_SR) Flush On-Going Mask */
#define OTPC_SR_FLUSH(value)                  (OTPC_SR_FLUSH_Msk & ((value) << OTPC_SR_FLUSH_Pos))
#define OTPC_SR_HIDE_Pos                      _U_(8)                                               /**< (OTPC_SR) Hiding On-Going Position */
#define OTPC_SR_HIDE_Msk                      (_U_(0x1) << OTPC_SR_HIDE_Pos)                       /**< (OTPC_SR) Hiding On-Going Mask */
#define OTPC_SR_HIDE(value)                   (OTPC_SR_HIDE_Msk & ((value) << OTPC_SR_HIDE_Pos))  
#define OTPC_SR_ONEF_Pos                      _U_(9)                                               /**< (OTPC_SR) One Found Position */
#define OTPC_SR_ONEF_Msk                      (_U_(0x1) << OTPC_SR_ONEF_Pos)                       /**< (OTPC_SR) One Found Mask */
#define OTPC_SR_ONEF(value)                   (OTPC_SR_ONEF_Msk & ((value) << OTPC_SR_ONEF_Pos))  
#define OTPC_SR_UNLOCK_Pos                    _U_(11)                                              /**< (OTPC_SR) OTP Registers Unlocked Position */
#define OTPC_SR_UNLOCK_Msk                    (_U_(0x1) << OTPC_SR_UNLOCK_Pos)                     /**< (OTPC_SR) OTP Registers Unlocked Mask */
#define OTPC_SR_UNLOCK(value)                 (OTPC_SR_UNLOCK_Msk & ((value) << OTPC_SR_UNLOCK_Pos))
#define OTPC_SR_AHIDE_Pos                     _U_(12)                                              /**< (OTPC_SR) Hiding On-Going Position */
#define OTPC_SR_AHIDE_Msk                     (_U_(0x1) << OTPC_SR_AHIDE_Pos)                      /**< (OTPC_SR) Hiding On-Going Mask */
#define OTPC_SR_AHIDE(value)                  (OTPC_SR_AHIDE_Msk & ((value) << OTPC_SR_AHIDE_Pos))
#define OTPC_SR_RPGM_Pos                      _U_(16)                                              /**< (OTPC_SR) ROM Programming On-Going Position */
#define OTPC_SR_RPGM_Msk                      (_U_(0x1) << OTPC_SR_RPGM_Pos)                       /**< (OTPC_SR) ROM Programming On-Going Mask */
#define OTPC_SR_RPGM(value)                   (OTPC_SR_RPGM_Msk & ((value) << OTPC_SR_RPGM_Pos))  
#define OTPC_SR_PPGM_Pos                      _U_(20)                                              /**< (OTPC_SR) Patch Programming On-Going Position */
#define OTPC_SR_PPGM_Msk                      (_U_(0x1) << OTPC_SR_PPGM_Pos)                       /**< (OTPC_SR) Patch Programming On-Going Mask */
#define OTPC_SR_PPGM(value)                   (OTPC_SR_PPGM_Msk & ((value) << OTPC_SR_PPGM_Pos))  
#define OTPC_SR_PEMUL_Pos                     _U_(21)                                              /**< (OTPC_SR) Patch Emulation Enabled Position */
#define OTPC_SR_PEMUL_Msk                     (_U_(0x1) << OTPC_SR_PEMUL_Pos)                      /**< (OTPC_SR) Patch Emulation Enabled Mask */
#define OTPC_SR_PEMUL(value)                  (OTPC_SR_PEMUL_Msk & ((value) << OTPC_SR_PEMUL_Pos))
#define OTPC_SR_PREAD_Pos                     _U_(22)                                              /**< (OTPC_SR) Patch Read On-Going Position */
#define OTPC_SR_PREAD_Msk                     (_U_(0x1) << OTPC_SR_PREAD_Pos)                      /**< (OTPC_SR) Patch Read On-Going Mask */
#define OTPC_SR_PREAD(value)                  (OTPC_SR_PREAD_Msk & ((value) << OTPC_SR_PREAD_Pos))
#define OTPC_SR_PREFRESH_Pos                  _U_(23)                                              /**< (OTPC_SR) Patch Refresh On-Going Position */
#define OTPC_SR_PREFRESH_Msk                  (_U_(0x1) << OTPC_SR_PREFRESH_Pos)                   /**< (OTPC_SR) Patch Refresh On-Going Mask */
#define OTPC_SR_PREFRESH(value)               (OTPC_SR_PREFRESH_Msk & ((value) << OTPC_SR_PREFRESH_Pos))
#define OTPC_SR_APGM_Pos                      _U_(24)                                              /**< (OTPC_SR) Engineering Programming On-Going Position */
#define OTPC_SR_APGM_Msk                      (_U_(0x1) << OTPC_SR_APGM_Pos)                       /**< (OTPC_SR) Engineering Programming On-Going Mask */
#define OTPC_SR_APGM(value)                   (OTPC_SR_APGM_Msk & ((value) << OTPC_SR_APGM_Pos))  
#define OTPC_SR_ALOCK_Pos                     _U_(25)                                              /**< (OTPC_SR) Engineering Lock On-Going Position */
#define OTPC_SR_ALOCK_Msk                     (_U_(0x1) << OTPC_SR_ALOCK_Pos)                      /**< (OTPC_SR) Engineering Lock On-Going Mask */
#define OTPC_SR_ALOCK(value)                  (OTPC_SR_ALOCK_Msk & ((value) << OTPC_SR_ALOCK_Pos))
#define OTPC_SR_AINVLD_Pos                    _U_(26)                                              /**< (OTPC_SR) Engineering Invalidation On-Going Position */
#define OTPC_SR_AINVLD_Msk                    (_U_(0x1) << OTPC_SR_AINVLD_Pos)                     /**< (OTPC_SR) Engineering Invalidation On-Going Mask */
#define OTPC_SR_AINVLD(value)                 (OTPC_SR_AINVLD_Msk & ((value) << OTPC_SR_AINVLD_Pos))
#define OTPC_SR_AEMUL_Pos                     _U_(27)                                              /**< (OTPC_SR) Engineering Emulation Enabled Position */
#define OTPC_SR_AEMUL_Msk                     (_U_(0x1) << OTPC_SR_AEMUL_Pos)                      /**< (OTPC_SR) Engineering Emulation Enabled Mask */
#define OTPC_SR_AEMUL(value)                  (OTPC_SR_AEMUL_Msk & ((value) << OTPC_SR_AEMUL_Pos))
#define OTPC_SR_AMKBB_Pos                     _U_(28)                                              /**< (OTPC_SR) Engineering Master Key Bus Busy Position */
#define OTPC_SR_AMKBB_Msk                     (_U_(0x1) << OTPC_SR_AMKBB_Pos)                      /**< (OTPC_SR) Engineering Master Key Bus Busy Mask */
#define OTPC_SR_AMKBB(value)                  (OTPC_SR_AMKBB_Msk & ((value) << OTPC_SR_AMKBB_Pos))
#define OTPC_SR_ASKBB_Pos                     _U_(29)                                              /**< (OTPC_SR) Engineering Slave Key Bus Busy Position */
#define OTPC_SR_ASKBB_Msk                     (_U_(0x1) << OTPC_SR_ASKBB_Pos)                      /**< (OTPC_SR) Engineering Slave Key Bus Busy Mask */
#define OTPC_SR_ASKBB(value)                  (OTPC_SR_ASKBB_Msk & ((value) << OTPC_SR_ASKBB_Pos))
#define OTPC_SR_AREAD_Pos                     _U_(30)                                              /**< (OTPC_SR) Engineering Read On-Going Position */
#define OTPC_SR_AREAD_Msk                     (_U_(0x1) << OTPC_SR_AREAD_Pos)                      /**< (OTPC_SR) Engineering Read On-Going Mask */
#define OTPC_SR_AREAD(value)                  (OTPC_SR_AREAD_Msk & ((value) << OTPC_SR_AREAD_Pos))
#define OTPC_SR_AFLUSH_Pos                    _U_(31)                                              /**< (OTPC_SR) Engineering Flush On-Going Position */
#define OTPC_SR_AFLUSH_Msk                    (_U_(0x1) << OTPC_SR_AFLUSH_Pos)                     /**< (OTPC_SR) Engineering Flush On-Going Mask */
#define OTPC_SR_AFLUSH(value)                 (OTPC_SR_AFLUSH_Msk & ((value) << OTPC_SR_AFLUSH_Pos))
#define OTPC_SR_Msk                           _U_(0xFFF11BFF)                                      /**< (OTPC_SR) Register Mask  */


/* -------- OTPC_IER : (OTPC Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define OTPC_IER_EOP_Pos                      _U_(0)                                               /**< (OTPC_IER) End Of Programming Interrupt Enable Position */
#define OTPC_IER_EOP_Msk                      (_U_(0x1) << OTPC_IER_EOP_Pos)                       /**< (OTPC_IER) End Of Programming Interrupt Enable Mask */
#define OTPC_IER_EOP(value)                   (OTPC_IER_EOP_Msk & ((value) << OTPC_IER_EOP_Pos))  
#define OTPC_IER_EOL_Pos                      _U_(1)                                               /**< (OTPC_IER) End Of Locking Interrupt Enable Position */
#define OTPC_IER_EOL_Msk                      (_U_(0x1) << OTPC_IER_EOL_Pos)                       /**< (OTPC_IER) End Of Locking Interrupt Enable Mask */
#define OTPC_IER_EOL(value)                   (OTPC_IER_EOL_Msk & ((value) << OTPC_IER_EOL_Pos))  
#define OTPC_IER_EOI_Pos                      _U_(2)                                               /**< (OTPC_IER) End Of Invalidation Interrupt Enable Position */
#define OTPC_IER_EOI_Msk                      (_U_(0x1) << OTPC_IER_EOI_Pos)                       /**< (OTPC_IER) End Of Invalidation Interrupt Enable Mask */
#define OTPC_IER_EOI(value)                   (OTPC_IER_EOI_Msk & ((value) << OTPC_IER_EOI_Pos))  
#define OTPC_IER_EOKT_Pos                     _U_(3)                                               /**< (OTPC_IER) End Of Key Transfer Interrupt Enable Position */
#define OTPC_IER_EOKT_Msk                     (_U_(0x1) << OTPC_IER_EOKT_Pos)                      /**< (OTPC_IER) End Of Key Transfer Interrupt Enable Mask */
#define OTPC_IER_EOKT(value)                  (OTPC_IER_EOKT_Msk & ((value) << OTPC_IER_EOKT_Pos))
#define OTPC_IER_PGERR_Pos                    _U_(4)                                               /**< (OTPC_IER) Programming Error Interrupt Enable Position */
#define OTPC_IER_PGERR_Msk                    (_U_(0x1) << OTPC_IER_PGERR_Pos)                     /**< (OTPC_IER) Programming Error Interrupt Enable Mask */
#define OTPC_IER_PGERR(value)                 (OTPC_IER_PGERR_Msk & ((value) << OTPC_IER_PGERR_Pos))
#define OTPC_IER_LKERR_Pos                    _U_(5)                                               /**< (OTPC_IER) Locking Error Interrupt Enable Position */
#define OTPC_IER_LKERR_Msk                    (_U_(0x1) << OTPC_IER_LKERR_Pos)                     /**< (OTPC_IER) Locking Error Interrupt Enable Mask */
#define OTPC_IER_LKERR(value)                 (OTPC_IER_LKERR_Msk & ((value) << OTPC_IER_LKERR_Pos))
#define OTPC_IER_IVERR_Pos                    _U_(6)                                               /**< (OTPC_IER) Invalidation Error Interrupt Enable Position */
#define OTPC_IER_IVERR_Msk                    (_U_(0x1) << OTPC_IER_IVERR_Pos)                     /**< (OTPC_IER) Invalidation Error Interrupt Enable Mask */
#define OTPC_IER_IVERR(value)                 (OTPC_IER_IVERR_Msk & ((value) << OTPC_IER_IVERR_Pos))
#define OTPC_IER_WERR_Pos                     _U_(7)                                               /**< (OTPC_IER) Write Error Interrupt Enable Position */
#define OTPC_IER_WERR_Msk                     (_U_(0x1) << OTPC_IER_WERR_Pos)                      /**< (OTPC_IER) Write Error Interrupt Enable Mask */
#define OTPC_IER_WERR(value)                  (OTPC_IER_WERR_Msk & ((value) << OTPC_IER_WERR_Pos))
#define OTPC_IER_EOR_Pos                      _U_(8)                                               /**< (OTPC_IER) End Of Read Interrupt Enable Position */
#define OTPC_IER_EOR_Msk                      (_U_(0x1) << OTPC_IER_EOR_Pos)                       /**< (OTPC_IER) End Of Read Interrupt Enable Mask */
#define OTPC_IER_EOR(value)                   (OTPC_IER_EOR_Msk & ((value) << OTPC_IER_EOR_Pos))  
#define OTPC_IER_EOF_Pos                      _U_(9)                                               /**< (OTPC_IER) End Of Flush Interrupt Enable Position */
#define OTPC_IER_EOF_Msk                      (_U_(0x1) << OTPC_IER_EOF_Pos)                       /**< (OTPC_IER) End Of Flush Interrupt Enable Mask */
#define OTPC_IER_EOF(value)                   (OTPC_IER_EOF_Msk & ((value) << OTPC_IER_EOF_Pos))  
#define OTPC_IER_EOH_Pos                      _U_(10)                                              /**< (OTPC_IER) End Of Hide Interrupt Enable Position */
#define OTPC_IER_EOH_Msk                      (_U_(0x1) << OTPC_IER_EOH_Pos)                       /**< (OTPC_IER) End Of Hide Interrupt Enable Mask */
#define OTPC_IER_EOH(value)                   (OTPC_IER_EOH_Msk & ((value) << OTPC_IER_EOH_Pos))  
#define OTPC_IER_EORF_Pos                     _U_(11)                                              /**< (OTPC_IER) End Of Refresh Interrupt Enable Position */
#define OTPC_IER_EORF_Msk                     (_U_(0x1) << OTPC_IER_EORF_Pos)                      /**< (OTPC_IER) End Of Refresh Interrupt Enable Mask */
#define OTPC_IER_EORF(value)                  (OTPC_IER_EORF_Msk & ((value) << OTPC_IER_EORF_Pos))
#define OTPC_IER_CKERR_Pos                    _U_(12)                                              /**< (OTPC_IER) Checksum Check Error Interrupt Enable Position */
#define OTPC_IER_CKERR_Msk                    (_U_(0x1) << OTPC_IER_CKERR_Pos)                     /**< (OTPC_IER) Checksum Check Error Interrupt Enable Mask */
#define OTPC_IER_CKERR(value)                 (OTPC_IER_CKERR_Msk & ((value) << OTPC_IER_CKERR_Pos))
#define OTPC_IER_COERR_Pos                    _U_(13)                                              /**< (OTPC_IER) Corruption Error Interrupt Enable Position */
#define OTPC_IER_COERR_Msk                    (_U_(0x1) << OTPC_IER_COERR_Pos)                     /**< (OTPC_IER) Corruption Error Interrupt Enable Mask */
#define OTPC_IER_COERR(value)                 (OTPC_IER_COERR_Msk & ((value) << OTPC_IER_COERR_Pos))
#define OTPC_IER_HDERR_Pos                    _U_(14)                                              /**< (OTPC_IER) Hide Error Interrupt Enable Position */
#define OTPC_IER_HDERR_Msk                    (_U_(0x1) << OTPC_IER_HDERR_Pos)                     /**< (OTPC_IER) Hide Error Interrupt Enable Mask */
#define OTPC_IER_HDERR(value)                 (OTPC_IER_HDERR_Msk & ((value) << OTPC_IER_HDERR_Pos))
#define OTPC_IER_KBERR_Pos                    _U_(16)                                              /**< (OTPC_IER) Key Bus Error Interrupt Enable Position */
#define OTPC_IER_KBERR_Msk                    (_U_(0x1) << OTPC_IER_KBERR_Pos)                     /**< (OTPC_IER) Key Bus Error Interrupt Enable Mask */
#define OTPC_IER_KBERR(value)                 (OTPC_IER_KBERR_Msk & ((value) << OTPC_IER_KBERR_Pos))
#define OTPC_IER_SECE_Pos                     _U_(28)                                              /**< (OTPC_IER) Security and/or Safety Event Interrupt Enable Position */
#define OTPC_IER_SECE_Msk                     (_U_(0x1) << OTPC_IER_SECE_Pos)                      /**< (OTPC_IER) Security and/or Safety Event Interrupt Enable Mask */
#define OTPC_IER_SECE(value)                  (OTPC_IER_SECE_Msk & ((value) << OTPC_IER_SECE_Pos))
#define OTPC_IER_Msk                          _U_(0x10017FFF)                                      /**< (OTPC_IER) Register Mask  */


