Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/otpc.h
/* -------- OTPC_UID2R : (OTPC Offset: 0x68) ( R/ 32) Product UID Register 2 -------- */
#define OTPC_UID2R_UID_Pos                    _U_(0)                                               /**< (OTPC_UID2R) Unique Product ID Position */
#define OTPC_UID2R_UID_Msk                    (_U_(0xFFFFFFFF) << OTPC_UID2R_UID_Pos)              /**< (OTPC_UID2R) Unique Product ID Mask */
#define OTPC_UID2R_UID(value)                 (OTPC_UID2R_UID_Msk & ((value) << OTPC_UID2R_UID_Pos))
#define OTPC_UID2R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_UID2R) Register Mask  */


/* -------- OTPC_UID3R : (OTPC Offset: 0x6C) ( R/ 32) Product UID Register 3 -------- */
#define OTPC_UID3R_UID_Pos                    _U_(0)                                               /**< (OTPC_UID3R) Unique Product ID Position */
#define OTPC_UID3R_UID_Msk                    (_U_(0xFFFFFFFF) << OTPC_UID3R_UID_Pos)              /**< (OTPC_UID3R) Unique Product ID Mask */
#define OTPC_UID3R_UID(value)                 (OTPC_UID3R_UID_Msk & ((value) << OTPC_UID3R_UID_Pos))
#define OTPC_UID3R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_UID3R) Register Mask  */


/* -------- OTPC_HCSR : (OTPC Offset: 0x70) (R/W 32) Hardware Configuration Selection Register -------- */
#define OTPC_HCSR_HCSEL_Pos                   _U_(0)                                               /**< (OTPC_HCSR) Hardware Configuration Selection Position */
#define OTPC_HCSR_HCSEL_Msk                   (_U_(0xF) << OTPC_HCSR_HCSEL_Pos)                    /**< (OTPC_HCSR) Hardware Configuration Selection Mask */
#define OTPC_HCSR_HCSEL(value)                (OTPC_HCSR_HCSEL_Msk & ((value) << OTPC_HCSR_HCSEL_Pos))
#define OTPC_HCSR_Msk                         _U_(0x0000000F)                                      /**< (OTPC_HCSR) Register Mask  */


/* -------- OTPC_HCDR : (OTPC Offset: 0x74) ( R/ 32) Hardware Configuration Data Register -------- */
#define OTPC_HCDR_HCFG_Pos                    _U_(0)                                               /**< (OTPC_HCDR) Hardware Configuration Value Position */
#define OTPC_HCDR_HCFG_Msk                    (_U_(0xFFFFFFFF) << OTPC_HCDR_HCFG_Pos)              /**< (OTPC_HCDR) Hardware Configuration Value Mask */
#define OTPC_HCDR_HCFG(value)                 (OTPC_HCDR_HCFG_Msk & ((value) << OTPC_HCDR_HCFG_Pos))
#define OTPC_HCDR_Msk                         _U_(0xFFFFFFFF)                                      /**< (OTPC_HCDR) Register Mask  */


/* -------- OTPC_HS0R : (OTPC Offset: 0x80) ( R/ 32) Hardware Security Register 0 -------- */
#define OTPC_HS0R_SCFG_Pos                    _U_(0)                                               /**< (OTPC_HS0R) Security Configuration Value Position */
#define OTPC_HS0R_SCFG_Msk                    (_U_(0xFFFFFFFF) << OTPC_HS0R_SCFG_Pos)              /**< (OTPC_HS0R) Security Configuration Value Mask */
#define OTPC_HS0R_SCFG(value)                 (OTPC_HS0R_SCFG_Msk & ((value) << OTPC_HS0R_SCFG_Pos))
#define OTPC_HS0R_Msk                         _U_(0xFFFFFFFF)                                      /**< (OTPC_HS0R) Register Mask  */


/* -------- OTPC_HS1R : (OTPC Offset: 0x84) ( R/ 32) Hardware Security Register 1 -------- */
#define OTPC_HS1R_SCFG_Pos                    _U_(0)                                               /**< (OTPC_HS1R) Security Configuration Value Position */
#define OTPC_HS1R_SCFG_Msk                    (_U_(0xFFFFFFFF) << OTPC_HS1R_SCFG_Pos)              /**< (OTPC_HS1R) Security Configuration Value Mask */
#define OTPC_HS1R_SCFG(value)                 (OTPC_HS1R_SCFG_Msk & ((value) << OTPC_HS1R_SCFG_Pos))
#define OTPC_HS1R_Msk                         _U_(0xFFFFFFFF)                                      /**< (OTPC_HS1R) Register Mask  */


/* -------- OTPC_OMR : (OTPC Offset: 0x90) (R/W 32) OTP Mode Register -------- */
#define OTPC_OMR_CHGRQ_Pos                    _U_(0)                                               /**< (OTPC_OMR) Change Request Position */
#define OTPC_OMR_CHGRQ_Msk                    (_U_(0x1) << OTPC_OMR_CHGRQ_Pos)                     /**< (OTPC_OMR) Change Request Mask */
#define OTPC_OMR_CHGRQ(value)                 (OTPC_OMR_CHGRQ_Msk & ((value) << OTPC_OMR_CHGRQ_Pos))
#define OTPC_OMR_KEY_Pos                      _U_(16)                                              /**< (OTPC_OMR) Key Position */
#define OTPC_OMR_KEY_Msk                      (_U_(0xFFFF) << OTPC_OMR_KEY_Pos)                    /**< (OTPC_OMR) Key Mask */
#define OTPC_OMR_KEY(value)                   (OTPC_OMR_KEY_Msk & ((value) << OTPC_OMR_KEY_Pos))  
#define OTPC_OMR_Msk                          _U_(0xFFFF0001)                                      /**< (OTPC_OMR) Register Mask  */


/* -------- OTPC_ODC0R : (OTPC Offset: 0xA0) (R/W 32) OTP DAP Configuration Register 0 -------- */
#define OTPC_ODC0R_DAPCFG_Pos                 _U_(0)                                               /**< (OTPC_ODC0R) DAP Configuration Position */
#define OTPC_ODC0R_DAPCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_ODC0R_DAPCFG_Pos)           /**< (OTPC_ODC0R) DAP Configuration Mask */
#define OTPC_ODC0R_DAPCFG(value)              (OTPC_ODC0R_DAPCFG_Msk & ((value) << OTPC_ODC0R_DAPCFG_Pos))
#define OTPC_ODC0R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_ODC0R) Register Mask  */


/* -------- OTPC_ODC1R : (OTPC Offset: 0xA4) (R/W 32) OTP DAP Configuration Register 1 -------- */
#define OTPC_ODC1R_DAPCFG_Pos                 _U_(0)                                               /**< (OTPC_ODC1R) DAP Configuration Position */
#define OTPC_ODC1R_DAPCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_ODC1R_DAPCFG_Pos)           /**< (OTPC_ODC1R) DAP Configuration Mask */
#define OTPC_ODC1R_DAPCFG(value)              (OTPC_ODC1R_DAPCFG_Msk & ((value) << OTPC_ODC1R_DAPCFG_Pos))
#define OTPC_ODC1R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_ODC1R) Register Mask  */


/* -------- OTPC_ODC2R : (OTPC Offset: 0xA8) (R/W 32) OTP DAP Configuration Register 2 -------- */
#define OTPC_ODC2R_DAPCFG_Pos                 _U_(0)                                               /**< (OTPC_ODC2R) DAP Configuration Position */
#define OTPC_ODC2R_DAPCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_ODC2R_DAPCFG_Pos)           /**< (OTPC_ODC2R) DAP Configuration Mask */
#define OTPC_ODC2R_DAPCFG(value)              (OTPC_ODC2R_DAPCFG_Msk & ((value) << OTPC_ODC2R_DAPCFG_Pos))
#define OTPC_ODC2R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_ODC2R) Register Mask  */


/* -------- OTPC_ODC3R : (OTPC Offset: 0xAC) (R/W 32) OTP DAP Configuration Register 3 -------- */
#define OTPC_ODC3R_DAPCFG_Pos                 _U_(0)                                               /**< (OTPC_ODC3R) DAP Configuration Position */
#define OTPC_ODC3R_DAPCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_ODC3R_DAPCFG_Pos)           /**< (OTPC_ODC3R) DAP Configuration Mask */
#define OTPC_ODC3R_DAPCFG(value)              (OTPC_ODC3R_DAPCFG_Msk & ((value) << OTPC_ODC3R_DAPCFG_Pos))
#define OTPC_ODC3R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_ODC3R) Register Mask  */


/* -------- OTPC_OPC0R : (OTPC Offset: 0xB0) (R/W 32) OTP PMC Configuration Register 0 -------- */
#define OTPC_OPC0R_PMCCFG_Pos                 _U_(0)                                               /**< (OTPC_OPC0R) PMC Configuration Position */
#define OTPC_OPC0R_PMCCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_OPC0R_PMCCFG_Pos)           /**< (OTPC_OPC0R) PMC Configuration Mask */
#define OTPC_OPC0R_PMCCFG(value)              (OTPC_OPC0R_PMCCFG_Msk & ((value) << OTPC_OPC0R_PMCCFG_Pos))
#define OTPC_OPC0R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_OPC0R) Register Mask  */


/* -------- OTPC_OPC1R : (OTPC Offset: 0xB4) (R/W 32) OTP PMC Configuration Register 1 -------- */
#define OTPC_OPC1R_PMCCFG_Pos                 _U_(0)                                               /**< (OTPC_OPC1R) PMC Configuration Position */
#define OTPC_OPC1R_PMCCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_OPC1R_PMCCFG_Pos)           /**< (OTPC_OPC1R) PMC Configuration Mask */
#define OTPC_OPC1R_PMCCFG(value)              (OTPC_OPC1R_PMCCFG_Msk & ((value) << OTPC_OPC1R_PMCCFG_Pos))
#define OTPC_OPC1R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_OPC1R) Register Mask  */


/* -------- OTPC_OPC2R : (OTPC Offset: 0xB8) (R/W 32) OTP PMC Configuration Register 2 -------- */
#define OTPC_OPC2R_PMCCFG_Pos                 _U_(0)                                               /**< (OTPC_OPC2R) PMC Configuration Position */
#define OTPC_OPC2R_PMCCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_OPC2R_PMCCFG_Pos)           /**< (OTPC_OPC2R) PMC Configuration Mask */
#define OTPC_OPC2R_PMCCFG(value)              (OTPC_OPC2R_PMCCFG_Msk & ((value) << OTPC_OPC2R_PMCCFG_Pos))
#define OTPC_OPC2R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_OPC2R) Register Mask  */


/* -------- OTPC_OPC3R : (OTPC Offset: 0xBC) (R/W 32) OTP PMC Configuration Register 3 -------- */
#define OTPC_OPC3R_PMCCFG_Pos                 _U_(0)                                               /**< (OTPC_OPC3R) PMC Configuration Position */
#define OTPC_OPC3R_PMCCFG_Msk                 (_U_(0xFFFFFFFF) << OTPC_OPC3R_PMCCFG_Pos)           /**< (OTPC_OPC3R) PMC Configuration Mask */
#define OTPC_OPC3R_PMCCFG(value)              (OTPC_OPC3R_PMCCFG_Msk & ((value) << OTPC_OPC3R_PMCCFG_Pos))
#define OTPC_OPC3R_Msk                        _U_(0xFFFFFFFF)                                      /**< (OTPC_OPC3R) Register Mask  */


/* -------- OTPC_WPMR : (OTPC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define OTPC_WPMR_WPCFEN_Pos                  _U_(0)                                               /**< (OTPC_WPMR) Write Protection Configuration Enable Position */
#define OTPC_WPMR_WPCFEN_Msk                  (_U_(0x1) << OTPC_WPMR_WPCFEN_Pos)                   /**< (OTPC_WPMR) Write Protection Configuration Enable Mask */
#define OTPC_WPMR_WPCFEN(value)               (OTPC_WPMR_WPCFEN_Msk & ((value) << OTPC_WPMR_WPCFEN_Pos))
#define OTPC_WPMR_WPITEN_Pos                  _U_(1)                                               /**< (OTPC_WPMR) Write Protection Interrupt Enable Position */
#define OTPC_WPMR_WPITEN_Msk                  (_U_(0x1) << OTPC_WPMR_WPITEN_Pos)                   /**< (OTPC_WPMR) Write Protection Interrupt Enable Mask */
#define OTPC_WPMR_WPITEN(value)               (OTPC_WPMR_WPITEN_Msk & ((value) << OTPC_WPMR_WPITEN_Pos))
#define OTPC_WPMR_WPCTEN_Pos                  _U_(2)                                               /**< (OTPC_WPMR) Write Protection Control Enable Position */
#define OTPC_WPMR_WPCTEN_Msk                  (_U_(0x1) << OTPC_WPMR_WPCTEN_Pos)                   /**< (OTPC_WPMR) Write Protection Control Enable Mask */
#define OTPC_WPMR_WPCTEN(value)               (OTPC_WPMR_WPCTEN_Msk & ((value) << OTPC_WPMR_WPCTEN_Pos))
#define OTPC_WPMR_FIRSTE_Pos                  _U_(4)                                               /**< (OTPC_WPMR) First Error Report Enable Position */
#define OTPC_WPMR_FIRSTE_Msk                  (_U_(0x1) << OTPC_WPMR_FIRSTE_Pos)                   /**< (OTPC_WPMR) First Error Report Enable Mask */
#define OTPC_WPMR_FIRSTE(value)               (OTPC_WPMR_FIRSTE_Msk & ((value) << OTPC_WPMR_FIRSTE_Pos))
#define OTPC_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (OTPC_WPMR) Write Protection Key Position */
#define OTPC_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << OTPC_WPMR_WPKEY_Pos)               /**< (OTPC_WPMR) Write Protection Key Mask */
#define OTPC_WPMR_WPKEY(value)                (OTPC_WPMR_WPKEY_Msk & ((value) << OTPC_WPMR_WPKEY_Pos))
#define   OTPC_WPMR_WPKEY_PASSWD_Val          _U_(0x4F5450)                                        /**< (OTPC_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define OTPC_WPMR_WPKEY_PASSWD                (OTPC_WPMR_WPKEY_PASSWD_Val << OTPC_WPMR_WPKEY_Pos)  /**< (OTPC_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define OTPC_WPMR_Msk                         _U_(0xFFFFFF17)                                      /**< (OTPC_WPMR) Register Mask  */


/* -------- OTPC_WPSR : (OTPC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define OTPC_WPSR_WPVS_Pos                    _U_(0)                                               /**< (OTPC_WPSR) Write Protection Violation Status (cleared on read) Position */
#define OTPC_WPSR_WPVS_Msk                    (_U_(0x1) << OTPC_WPSR_WPVS_Pos)                     /**< (OTPC_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define OTPC_WPSR_WPVS(value)                 (OTPC_WPSR_WPVS_Msk & ((value) << OTPC_WPSR_WPVS_Pos))
#define OTPC_WPSR_CGD_Pos                     _U_(1)                                               /**< (OTPC_WPSR) Clock Glitch Detected (cleared on read) Position */
#define OTPC_WPSR_CGD_Msk                     (_U_(0x1) << OTPC_WPSR_CGD_Pos)                      /**< (OTPC_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define OTPC_WPSR_CGD(value)                  (OTPC_WPSR_CGD_Msk & ((value) << OTPC_WPSR_CGD_Pos))
#define OTPC_WPSR_SEQE_Pos                    _U_(2)                                               /**< (OTPC_WPSR) Internal Sequencer Error (cleared on read) Position */
#define OTPC_WPSR_SEQE_Msk                    (_U_(0x1) << OTPC_WPSR_SEQE_Pos)                     /**< (OTPC_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define OTPC_WPSR_SEQE(value)                 (OTPC_WPSR_SEQE_Msk & ((value) << OTPC_WPSR_SEQE_Pos))
#define OTPC_WPSR_SWE_Pos                     _U_(3)                                               /**< (OTPC_WPSR) Software Control Error (cleared on read) Position */
#define OTPC_WPSR_SWE_Msk                     (_U_(0x1) << OTPC_WPSR_SWE_Pos)                      /**< (OTPC_WPSR) Software Control Error (cleared on read) Mask */
#define OTPC_WPSR_SWE(value)                  (OTPC_WPSR_SWE_Msk & ((value) << OTPC_WPSR_SWE_Pos))
#define OTPC_WPSR_WPVSRC_Pos                  _U_(8)                                               /**< (OTPC_WPSR) Write Protection Violation Source Position */
#define OTPC_WPSR_WPVSRC_Msk                  (_U_(0xFFFF) << OTPC_WPSR_WPVSRC_Pos)                /**< (OTPC_WPSR) Write Protection Violation Source Mask */
#define OTPC_WPSR_WPVSRC(value)               (OTPC_WPSR_WPVSRC_Msk & ((value) << OTPC_WPSR_WPVSRC_Pos))
#define OTPC_WPSR_SWETYP_Pos                  _U_(24)                                              /**< (OTPC_WPSR) Software Error Type Position */
#define OTPC_WPSR_SWETYP_Msk                  (_U_(0xF) << OTPC_WPSR_SWETYP_Pos)                   /**< (OTPC_WPSR) Software Error Type Mask */
#define OTPC_WPSR_SWETYP(value)               (OTPC_WPSR_SWETYP_Msk & ((value) << OTPC_WPSR_SWETYP_Pos))
#define   OTPC_WPSR_SWETYP_READ_WO_Val        _U_(0x0)                                             /**< (OTPC_WPSR) A write-only register has been read (warning).  */
#define   OTPC_WPSR_SWETYP_WRITE_RO_Val       _U_(0x1)                                             /**< (OTPC_WPSR) A write access has been performed on a read-only register (warning).  */
#define   OTPC_WPSR_SWETYP_CONF_CHG_Val       _U_(0x2)                                             /**< (OTPC_WPSR) A change has been made into the configuration (error).  */
#define   OTPC_WPSR_SWETYP_KEY_ERROR_Val      _U_(0x3)                                             /**< (OTPC_WPSR) A write has been computed in OTPC_CR, OTPC_ACR, OTPC_RCR, OTPC_PCR, OTPC_OMR or OTPC_WPMR register with a wrong value in the related KEY field (error).  */
#define OTPC_WPSR_SWETYP_READ_WO              (OTPC_WPSR_SWETYP_READ_WO_Val << OTPC_WPSR_SWETYP_Pos) /**< (OTPC_WPSR) A write-only register has been read (warning). Position  */
#define OTPC_WPSR_SWETYP_WRITE_RO             (OTPC_WPSR_SWETYP_WRITE_RO_Val << OTPC_WPSR_SWETYP_Pos) /**< (OTPC_WPSR) A write access has been performed on a read-only register (warning). Position  */
#define OTPC_WPSR_SWETYP_CONF_CHG             (OTPC_WPSR_SWETYP_CONF_CHG_Val << OTPC_WPSR_SWETYP_Pos) /**< (OTPC_WPSR) A change has been made into the configuration (error). Position  */
#define OTPC_WPSR_SWETYP_KEY_ERROR            (OTPC_WPSR_SWETYP_KEY_ERROR_Val << OTPC_WPSR_SWETYP_Pos) /**< (OTPC_WPSR) A write has been computed in OTPC_CR, OTPC_ACR, OTPC_RCR, OTPC_PCR, OTPC_OMR or OTPC_WPMR register with a wrong value in the related KEY field (error). Position  */
#define OTPC_WPSR_ECLASS_Pos                  _U_(31)                                              /**< (OTPC_WPSR) Software Error Class Position */
#define OTPC_WPSR_ECLASS_Msk                  (_U_(0x1) << OTPC_WPSR_ECLASS_Pos)                   /**< (OTPC_WPSR) Software Error Class Mask */
#define OTPC_WPSR_ECLASS(value)               (OTPC_WPSR_ECLASS_Msk & ((value) << OTPC_WPSR_ECLASS_Pos))
#define   OTPC_WPSR_ECLASS_WARNING_Val        _U_(0x0)                                             /**< (OTPC_WPSR) An abnormal access that does not have any impact.  */
#define   OTPC_WPSR_ECLASS_ERROR_Val          _U_(0x1)                                             /**< (OTPC_WPSR) An abnormal access that may have an impact.  */
#define OTPC_WPSR_ECLASS_WARNING              (OTPC_WPSR_ECLASS_WARNING_Val << OTPC_WPSR_ECLASS_Pos) /**< (OTPC_WPSR) An abnormal access that does not have any impact. Position  */
#define OTPC_WPSR_ECLASS_ERROR                (OTPC_WPSR_ECLASS_ERROR_Val << OTPC_WPSR_ECLASS_Pos) /**< (OTPC_WPSR) An abnormal access that may have an impact. Position  */
#define OTPC_WPSR_Msk                         _U_(0x8FFFFF0F)                                      /**< (OTPC_WPSR) Register Mask  */


/* -------- OTPC_VERSION : (OTPC Offset: 0xFC) ( R/ 32) Version Register -------- */
#define OTPC_VERSION_VERSION_Pos              _U_(0)                                               /**< (OTPC_VERSION) Hardware Module Version Position */
#define OTPC_VERSION_VERSION_Msk              (_U_(0xFFF) << OTPC_VERSION_VERSION_Pos)             /**< (OTPC_VERSION) Hardware Module Version Mask */
#define OTPC_VERSION_VERSION(value)           (OTPC_VERSION_VERSION_Msk & ((value) << OTPC_VERSION_VERSION_Pos))
#define OTPC_VERSION_MFN_Pos                  _U_(16)                                              /**< (OTPC_VERSION) Metal Fix Number Position */
#define OTPC_VERSION_MFN_Msk                  (_U_(0x7) << OTPC_VERSION_MFN_Pos)                   /**< (OTPC_VERSION) Metal Fix Number Mask */
#define OTPC_VERSION_MFN(value)               (OTPC_VERSION_MFN_Msk & ((value) << OTPC_VERSION_MFN_Pos))
#define OTPC_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (OTPC_VERSION) Register Mask  */


/* -------- OTPC_RCR : (OTPC Offset: 0x100) ( /W 32) ROM Control Register -------- */
#define OTPC_RCR_PGM_Pos                      _U_(0)                                               /**< (OTPC_RCR) Program Position */
#define OTPC_RCR_PGM_Msk                      (_U_(0x1) << OTPC_RCR_PGM_Pos)                       /**< (OTPC_RCR) Program Mask */
#define OTPC_RCR_PGM(value)                   (OTPC_RCR_PGM_Msk & ((value) << OTPC_RCR_PGM_Pos))  
#define OTPC_RCR_KEY_Pos                      _U_(16)                                              /**< (OTPC_RCR) Programming Key Position */
#define OTPC_RCR_KEY_Msk                      (_U_(0xFFFF) << OTPC_RCR_KEY_Pos)                    /**< (OTPC_RCR) Programming Key Mask */
#define OTPC_RCR_KEY(value)                   (OTPC_RCR_KEY_Msk & ((value) << OTPC_RCR_KEY_Pos))  
#define OTPC_RCR_Msk                          _U_(0xFFFF0001)                                      /**< (OTPC_RCR) Register Mask  */


