Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/otpc.h
/* -------- OTPC_RMR : (OTPC Offset: 0x104) (R/W 32) ROM Mode Register -------- */
#define OTPC_RMR_FWEN_Pos                     _U_(0)                                               /**< (OTPC_RMR) Firewall Enable Position */
#define OTPC_RMR_FWEN_Msk                     (_U_(0x1) << OTPC_RMR_FWEN_Pos)                      /**< (OTPC_RMR) Firewall Enable Mask */
#define OTPC_RMR_FWEN(value)                  (OTPC_RMR_FWEN_Msk & ((value) << OTPC_RMR_FWEN_Pos))
#define OTPC_RMR_RDDIS_Pos                    _U_(8)                                               /**< (OTPC_RMR) Read Disable Position */
#define OTPC_RMR_RDDIS_Msk                    (_U_(0x1) << OTPC_RMR_RDDIS_Pos)                     /**< (OTPC_RMR) Read Disable Mask */
#define OTPC_RMR_RDDIS(value)                 (OTPC_RMR_RDDIS_Msk & ((value) << OTPC_RMR_RDDIS_Pos))
#define OTPC_RMR_WRDIS_Pos                    _U_(9)                                               /**< (OTPC_RMR) Write Disable Position */
#define OTPC_RMR_WRDIS_Msk                    (_U_(0x1) << OTPC_RMR_WRDIS_Pos)                     /**< (OTPC_RMR) Write Disable Mask */
#define OTPC_RMR_WRDIS(value)                 (OTPC_RMR_WRDIS_Msk & ((value) << OTPC_RMR_WRDIS_Pos))
#define OTPC_RMR_LOCK_Pos                     _U_(15)                                              /**< (OTPC_RMR) Lock Register Position */
#define OTPC_RMR_LOCK_Msk                     (_U_(0x1) << OTPC_RMR_LOCK_Pos)                      /**< (OTPC_RMR) Lock Register Mask */
#define OTPC_RMR_LOCK(value)                  (OTPC_RMR_LOCK_Msk & ((value) << OTPC_RMR_LOCK_Pos))
#define OTPC_RMR_PGMODE_Pos                   _U_(16)                                              /**< (OTPC_RMR) Programming Mode Position */
#define OTPC_RMR_PGMODE_Msk                   (_U_(0x3) << OTPC_RMR_PGMODE_Pos)                    /**< (OTPC_RMR) Programming Mode Mask */
#define OTPC_RMR_PGMODE(value)                (OTPC_RMR_PGMODE_Msk & ((value) << OTPC_RMR_PGMODE_Pos))
#define   OTPC_RMR_PGMODE_ROM_NO_PGM_Val      _U_(0x0)                                             /**< (OTPC_RMR) ROM Code programming is disabled  */
#define   OTPC_RMR_PGMODE_ROM_SBUS_PGM_Val    _U_(0x1)                                             /**< (OTPC_RMR) ROM Code programming through System Bus Slave Interface  */
#define   OTPC_RMR_PGMODE_ROM_UI_ADDR_CONST_PGM_Val _U_(0x2)                                             /**< (OTPC_RMR) ROM Code programming through User Interface  */
#define   OTPC_RMR_PGMODE_ROM_UI_ADDR_INCR_PGM_Val _U_(0x3)                                             /**< (OTPC_RMR) ROM Code programming through User Interface with OTPC_RAR incremented after each programming.  */
#define OTPC_RMR_PGMODE_ROM_NO_PGM            (OTPC_RMR_PGMODE_ROM_NO_PGM_Val << OTPC_RMR_PGMODE_Pos) /**< (OTPC_RMR) ROM Code programming is disabled Position  */
#define OTPC_RMR_PGMODE_ROM_SBUS_PGM          (OTPC_RMR_PGMODE_ROM_SBUS_PGM_Val << OTPC_RMR_PGMODE_Pos) /**< (OTPC_RMR) ROM Code programming through System Bus Slave Interface Position  */
#define OTPC_RMR_PGMODE_ROM_UI_ADDR_CONST_PGM (OTPC_RMR_PGMODE_ROM_UI_ADDR_CONST_PGM_Val << OTPC_RMR_PGMODE_Pos) /**< (OTPC_RMR) ROM Code programming through User Interface Position  */
#define OTPC_RMR_PGMODE_ROM_UI_ADDR_INCR_PGM  (OTPC_RMR_PGMODE_ROM_UI_ADDR_INCR_PGM_Val << OTPC_RMR_PGMODE_Pos) /**< (OTPC_RMR) ROM Code programming through User Interface with OTPC_RAR incremented after each programming. Position  */
#define OTPC_RMR_Msk                          _U_(0x00038301)                                      /**< (OTPC_RMR) Register Mask  */


/* -------- OTPC_RAR : (OTPC Offset: 0x110) (R/W 32) ROM Address Register -------- */
#define OTPC_RAR_RADDR_Pos                    _U_(2)                                               /**< (OTPC_RAR) ROM Address Position */
#define OTPC_RAR_RADDR_Msk                    (_U_(0x3FFFFFFF) << OTPC_RAR_RADDR_Pos)              /**< (OTPC_RAR) ROM Address Mask */
#define OTPC_RAR_RADDR(value)                 (OTPC_RAR_RADDR_Msk & ((value) << OTPC_RAR_RADDR_Pos))
#define OTPC_RAR_Msk                          _U_(0xFFFFFFFC)                                      /**< (OTPC_RAR) Register Mask  */


/* -------- OTPC_RDR : (OTPC Offset: 0x114) (R/W 32) ROM Data Register -------- */
#define OTPC_RDR_RDATA_Pos                    _U_(0)                                               /**< (OTPC_RDR) ROM Data Position */
#define OTPC_RDR_RDATA_Msk                    (_U_(0xFFFFFFFF) << OTPC_RDR_RDATA_Pos)              /**< (OTPC_RDR) ROM Data Mask */
#define OTPC_RDR_RDATA(value)                 (OTPC_RDR_RDATA_Msk & ((value) << OTPC_RDR_RDATA_Pos))
#define OTPC_RDR_Msk                          _U_(0xFFFFFFFF)                                      /**< (OTPC_RDR) Register Mask  */


/* -------- OTPC_PCR : (OTPC Offset: 0x200) ( /W 32) Patch Control Register -------- */
#define OTPC_PCR_PGM_Pos                      _U_(0)                                               /**< (OTPC_PCR) Program Position */
#define OTPC_PCR_PGM_Msk                      (_U_(0x1) << OTPC_PCR_PGM_Pos)                       /**< (OTPC_PCR) Program Mask */
#define OTPC_PCR_PGM(value)                   (OTPC_PCR_PGM_Msk & ((value) << OTPC_PCR_PGM_Pos))  
#define OTPC_PCR_READ_Pos                     _U_(6)                                               /**< (OTPC_PCR) Read Patch Position */
#define OTPC_PCR_READ_Msk                     (_U_(0x1) << OTPC_PCR_READ_Pos)                      /**< (OTPC_PCR) Read Patch Mask */
#define OTPC_PCR_READ(value)                  (OTPC_PCR_READ_Msk & ((value) << OTPC_PCR_READ_Pos))
#define OTPC_PCR_REFRESH_Pos                  _U_(7)                                               /**< (OTPC_PCR) Refresh Patches Position */
#define OTPC_PCR_REFRESH_Msk                  (_U_(0x1) << OTPC_PCR_REFRESH_Pos)                   /**< (OTPC_PCR) Refresh Patches Mask */
#define OTPC_PCR_REFRESH(value)               (OTPC_PCR_REFRESH_Msk & ((value) << OTPC_PCR_REFRESH_Pos))
#define OTPC_PCR_KEY_Pos                      _U_(16)                                              /**< (OTPC_PCR) Programming Key Position */
#define OTPC_PCR_KEY_Msk                      (_U_(0xFFFF) << OTPC_PCR_KEY_Pos)                    /**< (OTPC_PCR) Programming Key Mask */
#define OTPC_PCR_KEY(value)                   (OTPC_PCR_KEY_Msk & ((value) << OTPC_PCR_KEY_Pos))  
#define OTPC_PCR_Msk                          _U_(0xFFFF00C1)                                      /**< (OTPC_PCR) Register Mask  */


/* -------- OTPC_PMR : (OTPC Offset: 0x204) (R/W 32) Patch Mode Register -------- */
#define OTPC_PMR_EMUL_Pos                     _U_(7)                                               /**< (OTPC_PMR) Emulation Mode Position */
#define OTPC_PMR_EMUL_Msk                     (_U_(0x1) << OTPC_PMR_EMUL_Pos)                      /**< (OTPC_PMR) Emulation Mode Mask */
#define OTPC_PMR_EMUL(value)                  (OTPC_PMR_EMUL_Msk & ((value) << OTPC_PMR_EMUL_Pos))
#define OTPC_PMR_RDDIS_Pos                    _U_(8)                                               /**< (OTPC_PMR) Read Disable Position */
#define OTPC_PMR_RDDIS_Msk                    (_U_(0x1) << OTPC_PMR_RDDIS_Pos)                     /**< (OTPC_PMR) Read Disable Mask */
#define OTPC_PMR_RDDIS(value)                 (OTPC_PMR_RDDIS_Msk & ((value) << OTPC_PMR_RDDIS_Pos))
#define OTPC_PMR_WRDIS_Pos                    _U_(9)                                               /**< (OTPC_PMR) Write Disable Position */
#define OTPC_PMR_WRDIS_Msk                    (_U_(0x1) << OTPC_PMR_WRDIS_Pos)                     /**< (OTPC_PMR) Write Disable Mask */
#define OTPC_PMR_WRDIS(value)                 (OTPC_PMR_WRDIS_Msk & ((value) << OTPC_PMR_WRDIS_Pos))
#define OTPC_PMR_LOCK_Pos                     _U_(15)                                              /**< (OTPC_PMR) Lock Register Position */
#define OTPC_PMR_LOCK_Msk                     (_U_(0x1) << OTPC_PMR_LOCK_Pos)                      /**< (OTPC_PMR) Lock Register Mask */
#define OTPC_PMR_LOCK(value)                  (OTPC_PMR_LOCK_Msk & ((value) << OTPC_PMR_LOCK_Pos))
#define OTPC_PMR_PID_Pos                      _U_(16)                                              /**< (OTPC_PMR) Patch ID Position */
#define OTPC_PMR_PID_Msk                      (_U_(0xF) << OTPC_PMR_PID_Pos)                       /**< (OTPC_PMR) Patch ID Mask */
#define OTPC_PMR_PID(value)                   (OTPC_PMR_PID_Msk & ((value) << OTPC_PMR_PID_Pos))  
#define OTPC_PMR_Msk                          _U_(0x000F8380)                                      /**< (OTPC_PMR) Register Mask  */


/* -------- OTPC_PSR : (OTPC Offset: 0x208) (R/W 32) Patch Software Register -------- */
#define OTPC_PSR_SOFT_Pos                     _U_(0)                                               /**< (OTPC_PSR) Software Value Position */
#define OTPC_PSR_SOFT_Msk                     (_U_(0xFFFFFFFF) << OTPC_PSR_SOFT_Pos)               /**< (OTPC_PSR) Software Value Mask */
#define OTPC_PSR_SOFT(value)                  (OTPC_PSR_SOFT_Msk & ((value) << OTPC_PSR_SOFT_Pos))
#define OTPC_PSR_Msk                          _U_(0xFFFFFFFF)                                      /**< (OTPC_PSR) Register Mask  */


/* -------- OTPC_PAR : (OTPC Offset: 0x210) (R/W 32) Patch Address Register -------- */
#define OTPC_PAR_VALID0_Pos                   _U_(0)                                               /**< (OTPC_PAR) Patch Validity Position */
#define OTPC_PAR_VALID0_Msk                   (_U_(0x3) << OTPC_PAR_VALID0_Pos)                    /**< (OTPC_PAR) Patch Validity Mask */
#define OTPC_PAR_VALID0(value)                (OTPC_PAR_VALID0_Msk & ((value) << OTPC_PAR_VALID0_Pos))
#define OTPC_PAR_PADDR_Pos                    _U_(2)                                               /**< (OTPC_PAR) Patch Address Position */
#define OTPC_PAR_PADDR_Msk                    (_U_(0x3FFFFFF) << OTPC_PAR_PADDR_Pos)               /**< (OTPC_PAR) Patch Address Mask */
#define OTPC_PAR_PADDR(value)                 (OTPC_PAR_PADDR_Msk & ((value) << OTPC_PAR_PADDR_Pos))
#define OTPC_PAR_VALID1_Pos                   _U_(28)                                              /**< (OTPC_PAR) Patch Validity Position */
#define OTPC_PAR_VALID1_Msk                   (_U_(0xF) << OTPC_PAR_VALID1_Pos)                    /**< (OTPC_PAR) Patch Validity Mask */
#define OTPC_PAR_VALID1(value)                (OTPC_PAR_VALID1_Msk & ((value) << OTPC_PAR_VALID1_Pos))
#define OTPC_PAR_Msk                          _U_(0xFFFFFFFF)                                      /**< (OTPC_PAR) Register Mask  */


