Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/otpc.h
/* -------- OTPC_PDR : (OTPC Offset: 0x214) (R/W 32) Patch Data Register -------- */
#define OTPC_PDR_PDATA_Pos                    _U_(0)                                               /**< (OTPC_PDR) Patch Data Position */
#define OTPC_PDR_PDATA_Msk                    (_U_(0xFFFFFFFF) << OTPC_PDR_PDATA_Pos)              /**< (OTPC_PDR) Patch Data Mask */
#define OTPC_PDR_PDATA(value)                 (OTPC_PDR_PDATA_Msk & ((value) << OTPC_PDR_PDATA_Pos))
#define OTPC_PDR_Msk                          _U_(0xFFFFFFFF)                                      /**< (OTPC_PDR) Register Mask  */


/* -------- OTPC_ACR : (OTPC Offset: 0x300) ( /W 32) A Control Register -------- */
#define OTPC_ACR_PGM_Pos                      _U_(0)                                               /**< (OTPC_ACR) Program Packet Position */
#define OTPC_ACR_PGM_Msk                      (_U_(0x1) << OTPC_ACR_PGM_Pos)                       /**< (OTPC_ACR) Program Packet Mask */
#define OTPC_ACR_PGM(value)                   (OTPC_ACR_PGM_Msk & ((value) << OTPC_ACR_PGM_Pos))  
#define OTPC_ACR_CKSGEN_Pos                   _U_(1)                                               /**< (OTPC_ACR) Generate Checksum Position */
#define OTPC_ACR_CKSGEN_Msk                   (_U_(0x1) << OTPC_ACR_CKSGEN_Pos)                    /**< (OTPC_ACR) Generate Checksum Mask */
#define OTPC_ACR_CKSGEN(value)                (OTPC_ACR_CKSGEN_Msk & ((value) << OTPC_ACR_CKSGEN_Pos))
#define OTPC_ACR_INVLD_Pos                    _U_(2)                                               /**< (OTPC_ACR) Invalidate Packet Position */
#define OTPC_ACR_INVLD_Msk                    (_U_(0x1) << OTPC_ACR_INVLD_Pos)                     /**< (OTPC_ACR) Invalidate Packet Mask */
#define OTPC_ACR_INVLD(value)                 (OTPC_ACR_INVLD_Msk & ((value) << OTPC_ACR_INVLD_Pos))
#define OTPC_ACR_HIDE_Pos                     _U_(4)                                               /**< (OTPC_ACR) Hide Packet Position */
#define OTPC_ACR_HIDE_Msk                     (_U_(0x1) << OTPC_ACR_HIDE_Pos)                      /**< (OTPC_ACR) Hide Packet Mask */
#define OTPC_ACR_HIDE(value)                  (OTPC_ACR_HIDE_Msk & ((value) << OTPC_ACR_HIDE_Pos))
#define OTPC_ACR_READ_Pos                     _U_(6)                                               /**< (OTPC_ACR) Read Area Position */
#define OTPC_ACR_READ_Msk                     (_U_(0x1) << OTPC_ACR_READ_Pos)                      /**< (OTPC_ACR) Read Area Mask */
#define OTPC_ACR_READ(value)                  (OTPC_ACR_READ_Msk & ((value) << OTPC_ACR_READ_Pos))
#define OTPC_ACR_FLUSH_Pos                    _U_(7)                                               /**< (OTPC_ACR) Flush Temporary Registers Position */
#define OTPC_ACR_FLUSH_Msk                    (_U_(0x1) << OTPC_ACR_FLUSH_Pos)                     /**< (OTPC_ACR) Flush Temporary Registers Mask */
#define OTPC_ACR_FLUSH(value)                 (OTPC_ACR_FLUSH_Msk & ((value) << OTPC_ACR_FLUSH_Pos))
#define OTPC_ACR_KBSTART_Pos                  _U_(8)                                               /**< (OTPC_ACR) Key Bus Transfer Start Position */
#define OTPC_ACR_KBSTART_Msk                  (_U_(0x1) << OTPC_ACR_KBSTART_Pos)                   /**< (OTPC_ACR) Key Bus Transfer Start Mask */
#define OTPC_ACR_KBSTART(value)               (OTPC_ACR_KBSTART_Msk & ((value) << OTPC_ACR_KBSTART_Pos))
#define OTPC_ACR_KBSTOP_Pos                   _U_(9)                                               /**< (OTPC_ACR) Key Bus Transfer Stop Position */
#define OTPC_ACR_KBSTOP_Msk                   (_U_(0x1) << OTPC_ACR_KBSTOP_Pos)                    /**< (OTPC_ACR) Key Bus Transfer Stop Mask */
#define OTPC_ACR_KBSTOP(value)                (OTPC_ACR_KBSTOP_Msk & ((value) << OTPC_ACR_KBSTOP_Pos))
#define OTPC_ACR_REFRESH_Pos                  _U_(15)                                              /**< (OTPC_ACR) Refresh the Area Position */
#define OTPC_ACR_REFRESH_Msk                  (_U_(0x1) << OTPC_ACR_REFRESH_Pos)                   /**< (OTPC_ACR) Refresh the Area Mask */
#define OTPC_ACR_REFRESH(value)               (OTPC_ACR_REFRESH_Msk & ((value) << OTPC_ACR_REFRESH_Pos))
#define OTPC_ACR_KEY_Pos                      _U_(16)                                              /**< (OTPC_ACR) Programming Key Position */
#define OTPC_ACR_KEY_Msk                      (_U_(0xFFFF) << OTPC_ACR_KEY_Pos)                    /**< (OTPC_ACR) Programming Key Mask */
#define OTPC_ACR_KEY(value)                   (OTPC_ACR_KEY_Msk & ((value) << OTPC_ACR_KEY_Pos))  
#define OTPC_ACR_Msk                          _U_(0xFFFF83D7)                                      /**< (OTPC_ACR) Register Mask  */


/* -------- OTPC_AMR : (OTPC Offset: 0x304) (R/W 32) A Mode Register -------- */
#define OTPC_AMR_UIDRDDIS_Pos                 _U_(0)                                               /**< (OTPC_AMR) UID Register Read Disable Position */
#define OTPC_AMR_UIDRDDIS_Msk                 (_U_(0x1) << OTPC_AMR_UIDRDDIS_Pos)                  /**< (OTPC_AMR) UID Register Read Disable Mask */
#define OTPC_AMR_UIDRDDIS(value)              (OTPC_AMR_UIDRDDIS_Msk & ((value) << OTPC_AMR_UIDRDDIS_Pos))
#define OTPC_AMR_HCGRDDIS_Pos                 _U_(1)                                               /**< (OTPC_AMR) Hardware Configuration Register Read Disable Position */
#define OTPC_AMR_HCGRDDIS_Msk                 (_U_(0x1) << OTPC_AMR_HCGRDDIS_Pos)                  /**< (OTPC_AMR) Hardware Configuration Register Read Disable Mask */
#define OTPC_AMR_HCGRDDIS(value)              (OTPC_AMR_HCGRDDIS_Msk & ((value) << OTPC_AMR_HCGRDDIS_Pos))
#define OTPC_AMR_SCGRDDIS_Pos                 _U_(2)                                               /**< (OTPC_AMR) Security Configuration Register Read Disable Position */
#define OTPC_AMR_SCGRDDIS_Msk                 (_U_(0x1) << OTPC_AMR_SCGRDDIS_Pos)                  /**< (OTPC_AMR) Security Configuration Register Read Disable Mask */
#define OTPC_AMR_SCGRDDIS(value)              (OTPC_AMR_SCGRDDIS_Msk & ((value) << OTPC_AMR_SCGRDDIS_Pos))
#define OTPC_AMR_NPCKT_Pos                    _U_(4)                                               /**< (OTPC_AMR) New Packet Position */
#define OTPC_AMR_NPCKT_Msk                    (_U_(0x1) << OTPC_AMR_NPCKT_Pos)                     /**< (OTPC_AMR) New Packet Mask */
#define OTPC_AMR_NPCKT(value)                 (OTPC_AMR_NPCKT_Msk & ((value) << OTPC_AMR_NPCKT_Pos))
#define OTPC_AMR_EMUL_Pos                     _U_(7)                                               /**< (OTPC_AMR) Emulation Mode Position */
#define OTPC_AMR_EMUL_Msk                     (_U_(0x1) << OTPC_AMR_EMUL_Pos)                      /**< (OTPC_AMR) Emulation Mode Mask */
#define OTPC_AMR_EMUL(value)                  (OTPC_AMR_EMUL_Msk & ((value) << OTPC_AMR_EMUL_Pos))
#define OTPC_AMR_RDDIS_Pos                    _U_(8)                                               /**< (OTPC_AMR) Read Disable Position */
#define OTPC_AMR_RDDIS_Msk                    (_U_(0x1) << OTPC_AMR_RDDIS_Pos)                     /**< (OTPC_AMR) Read Disable Mask */
#define OTPC_AMR_RDDIS(value)                 (OTPC_AMR_RDDIS_Msk & ((value) << OTPC_AMR_RDDIS_Pos))
#define OTPC_AMR_WRDIS_Pos                    _U_(9)                                               /**< (OTPC_AMR) Write Disable Position */
#define OTPC_AMR_WRDIS_Msk                    (_U_(0x1) << OTPC_AMR_WRDIS_Pos)                     /**< (OTPC_AMR) Write Disable Mask */
#define OTPC_AMR_WRDIS(value)                 (OTPC_AMR_WRDIS_Msk & ((value) << OTPC_AMR_WRDIS_Pos))
#define OTPC_AMR_KBDST_Pos                    _U_(12)                                              /**< (OTPC_AMR) Key Bus Destination Position */
#define OTPC_AMR_KBDST_Msk                    (_U_(0x1) << OTPC_AMR_KBDST_Pos)                     /**< (OTPC_AMR) Key Bus Destination Mask */
#define OTPC_AMR_KBDST(value)                 (OTPC_AMR_KBDST_Msk & ((value) << OTPC_AMR_KBDST_Pos))
#define   OTPC_AMR_KBDST_TDES_Val             _U_(0x0)                                             /**< (OTPC_AMR) The TDES is the destination of the key transfer.  */
#define   OTPC_AMR_KBDST_AES_Val              _U_(0x1)                                             /**< (OTPC_AMR) The AES is the destination of the key transfer.  */
#define OTPC_AMR_KBDST_TDES                   (OTPC_AMR_KBDST_TDES_Val << OTPC_AMR_KBDST_Pos)      /**< (OTPC_AMR) The TDES is the destination of the key transfer. Position  */
#define OTPC_AMR_KBDST_AES                    (OTPC_AMR_KBDST_AES_Val << OTPC_AMR_KBDST_Pos)       /**< (OTPC_AMR) The AES is the destination of the key transfer. Position  */
#define OTPC_AMR_LOCK_Pos                     _U_(15)                                              /**< (OTPC_AMR) Lock Register Position */
#define OTPC_AMR_LOCK_Msk                     (_U_(0x1) << OTPC_AMR_LOCK_Pos)                      /**< (OTPC_AMR) Lock Register Mask */
#define OTPC_AMR_LOCK(value)                  (OTPC_AMR_LOCK_Msk & ((value) << OTPC_AMR_LOCK_Pos))
#define OTPC_AMR_AADDR_Pos                    _U_(16)                                              /**< (OTPC_AMR) Address Position */
#define OTPC_AMR_AADDR_Msk                    (_U_(0xFFFF) << OTPC_AMR_AADDR_Pos)                  /**< (OTPC_AMR) Address Mask */
#define OTPC_AMR_AADDR(value)                 (OTPC_AMR_AADDR_Msk & ((value) << OTPC_AMR_AADDR_Pos))
#define OTPC_AMR_Msk                          _U_(0xFFFF9397)                                      /**< (OTPC_AMR) Register Mask  */


/* -------- OTPC_AAR : (OTPC Offset: 0x308) (R/W 32) A Address Register -------- */
#define OTPC_AAR_DADDR_Pos                    _U_(0)                                               /**< (OTPC_AAR) Data Address Position */
#define OTPC_AAR_DADDR_Msk                    (_U_(0xFF) << OTPC_AAR_DADDR_Pos)                    /**< (OTPC_AAR) Data Address Mask */
#define OTPC_AAR_DADDR(value)                 (OTPC_AAR_DADDR_Msk & ((value) << OTPC_AAR_DADDR_Pos))
#define OTPC_AAR_INCRT_Pos                    _U_(16)                                              /**< (OTPC_AAR) Increment Type Position */
#define OTPC_AAR_INCRT_Msk                    (_U_(0x1) << OTPC_AAR_INCRT_Pos)                     /**< (OTPC_AAR) Increment Type Mask */
#define OTPC_AAR_INCRT(value)                 (OTPC_AAR_INCRT_Msk & ((value) << OTPC_AAR_INCRT_Pos))
#define   OTPC_AAR_INCRT_AFTER_READ_Val       _U_(0x0)                                             /**< (OTPC_AAR) Increment DADDR after a read of OTPC_ADR.  */
#define   OTPC_AAR_INCRT_AFTER_WRITE_Val      _U_(0x1)                                             /**< (OTPC_AAR) Increment DADDR after a write of OTPC_ADR.  */
#define OTPC_AAR_INCRT_AFTER_READ             (OTPC_AAR_INCRT_AFTER_READ_Val << OTPC_AAR_INCRT_Pos) /**< (OTPC_AAR) Increment DADDR after a read of OTPC_ADR. Position  */
#define OTPC_AAR_INCRT_AFTER_WRITE            (OTPC_AAR_INCRT_AFTER_WRITE_Val << OTPC_AAR_INCRT_Pos) /**< (OTPC_AAR) Increment DADDR after a write of OTPC_ADR. Position  */
#define OTPC_AAR_Msk                          _U_(0x000100FF)                                      /**< (OTPC_AAR) Register Mask  */


/* -------- OTPC_AHR : (OTPC Offset: 0x310) (R/W 32) A Header Register -------- */
#define OTPC_AHR_PACKET_Pos                   _U_(0)                                               /**< (OTPC_AHR) Packet Type Position */
#define OTPC_AHR_PACKET_Msk                   (_U_(0x7) << OTPC_AHR_PACKET_Pos)                    /**< (OTPC_AHR) Packet Type Mask */
#define OTPC_AHR_PACKET(value)                (OTPC_AHR_PACKET_Msk & ((value) << OTPC_AHR_PACKET_Pos))
#define   OTPC_AHR_PACKET_REGULAR_Val         _U_(0x1)                                             /**< (OTPC_AHR) Regular packet accessible through the User Interface.  */
#define   OTPC_AHR_PACKET_KEY_Val             _U_(0x2)                                             /**< (OTPC_AHR) Key packet accessible only through the Key buses.  */
#define   OTPC_AHR_PACKET_PRODUCT_UID_Val     _U_(0x4)                                             /**< (OTPC_AHR) Product UID packet.  */
#define   OTPC_AHR_PACKET_HARDWARE_CONFIGURATION_Val _U_(0x5)                                             /**< (OTPC_AHR) Hardware Configuration packet.  */
#define   OTPC_AHR_PACKET_SECURITY_CONFIGURATION_Val _U_(0x6)                                             /**< (OTPC_AHR) Security Configuration packet.  */
#define OTPC_AHR_PACKET_REGULAR               (OTPC_AHR_PACKET_REGULAR_Val << OTPC_AHR_PACKET_Pos) /**< (OTPC_AHR) Regular packet accessible through the User Interface. Position  */
#define OTPC_AHR_PACKET_KEY                   (OTPC_AHR_PACKET_KEY_Val << OTPC_AHR_PACKET_Pos)     /**< (OTPC_AHR) Key packet accessible only through the Key buses. Position  */
#define OTPC_AHR_PACKET_PRODUCT_UID           (OTPC_AHR_PACKET_PRODUCT_UID_Val << OTPC_AHR_PACKET_Pos) /**< (OTPC_AHR) Product UID packet. Position  */
#define OTPC_AHR_PACKET_HARDWARE_CONFIGURATION (OTPC_AHR_PACKET_HARDWARE_CONFIGURATION_Val << OTPC_AHR_PACKET_Pos) /**< (OTPC_AHR) Hardware Configuration packet. Position  */
#define OTPC_AHR_PACKET_SECURITY_CONFIGURATION (OTPC_AHR_PACKET_SECURITY_CONFIGURATION_Val << OTPC_AHR_PACKET_Pos) /**< (OTPC_AHR) Security Configuration packet. Position  */
#define OTPC_AHR_LOCK_Pos                     _U_(3)                                               /**< (OTPC_AHR) Lock Status Position */
#define OTPC_AHR_LOCK_Msk                     (_U_(0x1) << OTPC_AHR_LOCK_Pos)                      /**< (OTPC_AHR) Lock Status Mask */
#define OTPC_AHR_LOCK(value)                  (OTPC_AHR_LOCK_Msk & ((value) << OTPC_AHR_LOCK_Pos))
#define OTPC_AHR_INVLD_Pos                    _U_(4)                                               /**< (OTPC_AHR) Invalid Status Position */
#define OTPC_AHR_INVLD_Msk                    (_U_(0x3) << OTPC_AHR_INVLD_Pos)                     /**< (OTPC_AHR) Invalid Status Mask */
#define OTPC_AHR_INVLD(value)                 (OTPC_AHR_INVLD_Msk & ((value) << OTPC_AHR_INVLD_Pos))
#define OTPC_AHR_ONE_Pos                      _U_(7)                                               /**< (OTPC_AHR) One Position */
#define OTPC_AHR_ONE_Msk                      (_U_(0x1) << OTPC_AHR_ONE_Pos)                       /**< (OTPC_AHR) One Mask */
#define OTPC_AHR_ONE(value)                   (OTPC_AHR_ONE_Msk & ((value) << OTPC_AHR_ONE_Pos))  
#define OTPC_AHR_SIZE_Pos                     _U_(8)                                               /**< (OTPC_AHR) Packet Size Position */
#define OTPC_AHR_SIZE_Msk                     (_U_(0xFF) << OTPC_AHR_SIZE_Pos)                     /**< (OTPC_AHR) Packet Size Mask */
#define OTPC_AHR_SIZE(value)                  (OTPC_AHR_SIZE_Msk & ((value) << OTPC_AHR_SIZE_Pos))
#define OTPC_AHR_CHECKSUM_Pos                 _U_(16)                                              /**< (OTPC_AHR) Packet Checksum Position */
#define OTPC_AHR_CHECKSUM_Msk                 (_U_(0xFFFF) << OTPC_AHR_CHECKSUM_Pos)               /**< (OTPC_AHR) Packet Checksum Mask */
#define OTPC_AHR_CHECKSUM(value)              (OTPC_AHR_CHECKSUM_Msk & ((value) << OTPC_AHR_CHECKSUM_Pos))
#define OTPC_AHR_Msk                          _U_(0xFFFFFFBF)                                      /**< (OTPC_AHR) Register Mask  */


/* -------- OTPC_ADR : (OTPC Offset: 0x314) (R/W 32) A Data Register -------- */
#define OTPC_ADR_ADATA_Pos                    _U_(0)                                               /**< (OTPC_ADR) Engineering Packet Data Position */
#define OTPC_ADR_ADATA_Msk                    (_U_(0xFFFFFFFF) << OTPC_ADR_ADATA_Pos)              /**< (OTPC_ADR) Engineering Packet Data Mask */
#define OTPC_ADR_ADATA(value)                 (OTPC_ADR_ADATA_Msk & ((value) << OTPC_ADR_ADATA_Pos))
#define OTPC_ADR_Msk                          _U_(0xFFFFFFFF)                                      /**< (OTPC_ADR) Register Mask  */


/** \brief OTPC register offsets definitions */
#define OTPC_CR_REG_OFST               (0x00)              /**< (OTPC_CR) Control Register Offset */
#define OTPC_MR_REG_OFST               (0x04)              /**< (OTPC_MR) Mode Register Offset */
#define OTPC_AR_REG_OFST               (0x08)              /**< (OTPC_AR) Address Register Offset */
#define OTPC_SR_REG_OFST               (0x0C)              /**< (OTPC_SR) Status Register Offset */
#define OTPC_IER_REG_OFST              (0x10)              /**< (OTPC_IER) Interrupt Enable Register Offset */
#define OTPC_IDR_REG_OFST              (0x14)              /**< (OTPC_IDR) Interrupt Disable Register Offset */
#define OTPC_IMR_REG_OFST              (0x18)              /**< (OTPC_IMR) Interrupt Mask Register Offset */
#define OTPC_ISR_REG_OFST              (0x1C)              /**< (OTPC_ISR) Interrupt Status Register Offset */
#define OTPC_HR_REG_OFST               (0x20)              /**< (OTPC_HR) Header Register Offset */
#define OTPC_DR_REG_OFST               (0x24)              /**< (OTPC_DR) Data Register Offset */
#define OTPC_BAR_REG_OFST              (0x30)              /**< (OTPC_BAR) Boot Addresses Register Offset */
#define OTPC_CAR_REG_OFST              (0x34)              /**< (OTPC_CAR) Custom Address Register Offset */
#define OTPC_UHC0R_REG_OFST            (0x50)              /**< (OTPC_UHC0R) User Hardware Configuration 0 Register Offset */
#define OTPC_UHC1R_REG_OFST            (0x54)              /**< (OTPC_UHC1R) User Hardware Configuration 1 Register Offset */
#define OTPC_UID0R_REG_OFST            (0x60)              /**< (OTPC_UID0R) Product UID Register 0 Offset */
#define OTPC_UID1R_REG_OFST            (0x64)              /**< (OTPC_UID1R) Product UID Register 1 Offset */
#define OTPC_UID2R_REG_OFST            (0x68)              /**< (OTPC_UID2R) Product UID Register 2 Offset */
#define OTPC_UID3R_REG_OFST            (0x6C)              /**< (OTPC_UID3R) Product UID Register 3 Offset */
#define OTPC_HCSR_REG_OFST             (0x70)              /**< (OTPC_HCSR) Hardware Configuration Selection Register Offset */
#define OTPC_HCDR_REG_OFST             (0x74)              /**< (OTPC_HCDR) Hardware Configuration Data Register Offset */
#define OTPC_HS0R_REG_OFST             (0x80)              /**< (OTPC_HS0R) Hardware Security Register 0 Offset */
#define OTPC_HS1R_REG_OFST             (0x84)              /**< (OTPC_HS1R) Hardware Security Register 1 Offset */
#define OTPC_OMR_REG_OFST              (0x90)              /**< (OTPC_OMR) OTP Mode Register Offset */
#define OTPC_ODC0R_REG_OFST            (0xA0)              /**< (OTPC_ODC0R) OTP DAP Configuration Register 0 Offset */
#define OTPC_ODC1R_REG_OFST            (0xA4)              /**< (OTPC_ODC1R) OTP DAP Configuration Register 1 Offset */
#define OTPC_ODC2R_REG_OFST            (0xA8)              /**< (OTPC_ODC2R) OTP DAP Configuration Register 2 Offset */
#define OTPC_ODC3R_REG_OFST            (0xAC)              /**< (OTPC_ODC3R) OTP DAP Configuration Register 3 Offset */
#define OTPC_OPC0R_REG_OFST            (0xB0)              /**< (OTPC_OPC0R) OTP PMC Configuration Register 0 Offset */
#define OTPC_OPC1R_REG_OFST            (0xB4)              /**< (OTPC_OPC1R) OTP PMC Configuration Register 1 Offset */
#define OTPC_OPC2R_REG_OFST            (0xB8)              /**< (OTPC_OPC2R) OTP PMC Configuration Register 2 Offset */
#define OTPC_OPC3R_REG_OFST            (0xBC)              /**< (OTPC_OPC3R) OTP PMC Configuration Register 3 Offset */
#define OTPC_WPMR_REG_OFST             (0xE4)              /**< (OTPC_WPMR) Write Protection Mode Register Offset */
#define OTPC_WPSR_REG_OFST             (0xE8)              /**< (OTPC_WPSR) Write Protection Status Register Offset */
#define OTPC_VERSION_REG_OFST          (0xFC)              /**< (OTPC_VERSION) Version Register Offset */
#define OTPC_RCR_REG_OFST              (0x100)             /**< (OTPC_RCR) ROM Control Register Offset */
#define OTPC_RMR_REG_OFST              (0x104)             /**< (OTPC_RMR) ROM Mode Register Offset */
#define OTPC_RAR_REG_OFST              (0x110)             /**< (OTPC_RAR) ROM Address Register Offset */
#define OTPC_RDR_REG_OFST              (0x114)             /**< (OTPC_RDR) ROM Data Register Offset */
#define OTPC_PCR_REG_OFST              (0x200)             /**< (OTPC_PCR) Patch Control Register Offset */
#define OTPC_PMR_REG_OFST              (0x204)             /**< (OTPC_PMR) Patch Mode Register Offset */
#define OTPC_PSR_REG_OFST              (0x208)             /**< (OTPC_PSR) Patch Software Register Offset */
#define OTPC_PAR_REG_OFST              (0x210)             /**< (OTPC_PAR) Patch Address Register Offset */
#define OTPC_PDR_REG_OFST              (0x214)             /**< (OTPC_PDR) Patch Data Register Offset */
#define OTPC_ACR_REG_OFST              (0x300)             /**< (OTPC_ACR) A Control Register Offset */
#define OTPC_AMR_REG_OFST              (0x304)             /**< (OTPC_AMR) A Mode Register Offset */
#define OTPC_AAR_REG_OFST              (0x308)             /**< (OTPC_AAR) A Address Register Offset */
#define OTPC_AHR_REG_OFST              (0x310)             /**< (OTPC_AHR) A Header Register Offset */
#define OTPC_ADR_REG_OFST              (0x314)             /**< (OTPC_ADR) A Data Register Offset */

