Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/otpc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief OTPC register API structure */
typedef struct
{
  __O   uint32_t                       OTPC_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       OTPC_MR;            /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       OTPC_AR;            /**< Offset: 0x08 (R/W  32) Address Register */
  __I   uint32_t                       OTPC_SR;            /**< Offset: 0x0C (R/   32) Status Register */
  __O   uint32_t                       OTPC_IER;           /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       OTPC_IDR;           /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       OTPC_IMR;           /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       OTPC_ISR;           /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __IO  uint32_t                       OTPC_HR;            /**< Offset: 0x20 (R/W  32) Header Register */
  __IO  uint32_t                       OTPC_DR;            /**< Offset: 0x24 (R/W  32) Data Register */
  __I   uint8_t                        Reserved1[0x08];
  __I   uint32_t                       OTPC_BAR;           /**< Offset: 0x30 (R/   32) Boot Addresses Register */
  __I   uint32_t                       OTPC_CAR;           /**< Offset: 0x34 (R/   32) Custom Address Register */
  __I   uint8_t                        Reserved2[0x18];
  __I   uint32_t                       OTPC_UHC0R;         /**< Offset: 0x50 (R/   32) User Hardware Configuration 0 Register */
  __I   uint32_t                       OTPC_UHC1R;         /**< Offset: 0x54 (R/   32) User Hardware Configuration 1 Register */
  __I   uint8_t                        Reserved3[0x08];
  __I   uint32_t                       OTPC_UID0R;         /**< Offset: 0x60 (R/   32) Product UID Register 0 */
  __I   uint32_t                       OTPC_UID1R;         /**< Offset: 0x64 (R/   32) Product UID Register 1 */
  __I   uint32_t                       OTPC_UID2R;         /**< Offset: 0x68 (R/   32) Product UID Register 2 */
  __I   uint32_t                       OTPC_UID3R;         /**< Offset: 0x6C (R/   32) Product UID Register 3 */
  __IO  uint32_t                       OTPC_HCSR;          /**< Offset: 0x70 (R/W  32) Hardware Configuration Selection Register */
  __I   uint32_t                       OTPC_HCDR;          /**< Offset: 0x74 (R/   32) Hardware Configuration Data Register */
  __I   uint8_t                        Reserved4[0x08];
  __I   uint32_t                       OTPC_HS0R;          /**< Offset: 0x80 (R/   32) Hardware Security Register 0 */
  __I   uint32_t                       OTPC_HS1R;          /**< Offset: 0x84 (R/   32) Hardware Security Register 1 */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       OTPC_OMR;           /**< Offset: 0x90 (R/W  32) OTP Mode Register */
  __I   uint8_t                        Reserved6[0x0C];
  __IO  uint32_t                       OTPC_ODC0R;         /**< Offset: 0xA0 (R/W  32) OTP DAP Configuration Register 0 */
  __IO  uint32_t                       OTPC_ODC1R;         /**< Offset: 0xA4 (R/W  32) OTP DAP Configuration Register 1 */
  __IO  uint32_t                       OTPC_ODC2R;         /**< Offset: 0xA8 (R/W  32) OTP DAP Configuration Register 2 */
  __IO  uint32_t                       OTPC_ODC3R;         /**< Offset: 0xAC (R/W  32) OTP DAP Configuration Register 3 */
  __IO  uint32_t                       OTPC_OPC0R;         /**< Offset: 0xB0 (R/W  32) OTP PMC Configuration Register 0 */
  __IO  uint32_t                       OTPC_OPC1R;         /**< Offset: 0xB4 (R/W  32) OTP PMC Configuration Register 1 */
  __IO  uint32_t                       OTPC_OPC2R;         /**< Offset: 0xB8 (R/W  32) OTP PMC Configuration Register 2 */
  __IO  uint32_t                       OTPC_OPC3R;         /**< Offset: 0xBC (R/W  32) OTP PMC Configuration Register 3 */
  __I   uint8_t                        Reserved7[0x24];
  __IO  uint32_t                       OTPC_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       OTPC_WPSR;          /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved8[0x10];
  __I   uint32_t                       OTPC_VERSION;       /**< Offset: 0xFC (R/   32) Version Register */
  __O   uint32_t                       OTPC_RCR;           /**< Offset: 0x100 ( /W  32) ROM Control Register */
  __IO  uint32_t                       OTPC_RMR;           /**< Offset: 0x104 (R/W  32) ROM Mode Register */
  __I   uint8_t                        Reserved9[0x08];
  __IO  uint32_t                       OTPC_RAR;           /**< Offset: 0x110 (R/W  32) ROM Address Register */
  __IO  uint32_t                       OTPC_RDR;           /**< Offset: 0x114 (R/W  32) ROM Data Register */
  __I   uint8_t                        Reserved10[0xE8];
  __O   uint32_t                       OTPC_PCR;           /**< Offset: 0x200 ( /W  32) Patch Control Register */
  __IO  uint32_t                       OTPC_PMR;           /**< Offset: 0x204 (R/W  32) Patch Mode Register */
  __IO  uint32_t                       OTPC_PSR;           /**< Offset: 0x208 (R/W  32) Patch Software Register */
  __I   uint8_t                        Reserved11[0x04];
  __IO  uint32_t                       OTPC_PAR;           /**< Offset: 0x210 (R/W  32) Patch Address Register */
  __IO  uint32_t                       OTPC_PDR;           /**< Offset: 0x214 (R/W  32) Patch Data Register */
  __I   uint8_t                        Reserved12[0xE8];
  __O   uint32_t                       OTPC_ACR;           /**< Offset: 0x300 ( /W  32) A Control Register */
  __IO  uint32_t                       OTPC_AMR;           /**< Offset: 0x304 (R/W  32) A Mode Register */
  __IO  uint32_t                       OTPC_AAR;           /**< Offset: 0x308 (R/W  32) A Address Register */
  __I   uint8_t                        Reserved13[0x04];
  __IO  uint32_t                       OTPC_AHR;           /**< Offset: 0x310 (R/W  32) A Header Register */
  __IO  uint32_t                       OTPC_ADR;           /**< Offset: 0x314 (R/W  32) A Data Register */
} otpc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_OTPC_COMPONENT_H_ */
